app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.page(params[:page]).per(3)

SELECT "posts".* FROM "posts"
---
  def show
    @posts = Post.all

INSERT INTO "posts" ("title", "content", "user_id", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "ActorWow"], ["content", "Wow"], ["user_id", 8], ["image", "299801.700xp.jpg"], ["created_at", "2018-09-14 14:12:30.066109"], ["updated_at", "2018-09-14 14:12:30.066109"]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["image", "goru_kitaya.jpg"], ["updated_at", "2018-09-16 12:24:58.440316"], ["id", 8]]
---
  def update

    puts post_params.inspect

    respond_to do |format|
      if @post.update(post_params)